---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.#ctor
source: html/4b15a6d5-4fe4-f250-a142-e5012888e168.htm
---
# Autodesk.Revit.DB.FailureMessageKey.#ctor Method

Constructs a new FailureMessageKey with default settings.

## Syntax (C#)
```csharp
public FailureMessageKey()
```